permeability/square-tube-flow-rate/system/controlDict
FoamFile
{
  version 2.0;
  format ascii;
  class dictionary;
  object controlDict;
}

application pimpleFoam;

startFrom latestTime;
startTime 0;
stopAt endTime;
endTime 1.0;
deltaT 1e-6;

writeControl adjustableRunTime;
writeInterval 0.1;
purgeWrite 0;
writeFormat binary;
writePrecision 8;
writeCompression off;

timeFormat general;
timePrecision 6;

runTimeModifiable true;

adjustTimeStep yes;
maxCo 0.8;

functions
{
  vol-averaged-velocity
  {
    type volFieldValue;
    libs ("libfieldFunctionObjects.so");

    log true;

    writeControl adjustableRunTime;
    writeInterval 1e-3;
    writeFields false;

    regionType all;
    operation volAverage;

    fields
    (
      U
    );
  }
}

// vi: set ft=foam et sw=2 ts=2 sts=2:
