permeability/square-tube-flow-rate/constant/turbulenceProperties
FoamFile
{
  version 2.0;
  format ascii;
  class dictionary;
  object turbulenceProperties;
}

simulationType laminar;

// vi: set ft=foam et sw=2 ts=2 sts=2:
