permeability/square-tube-flow-rate/0/U
FoamFile
{
  version 2.0;
  format ascii;
  class volVectorField;
  object U;
}

dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 0);

boundaryField
{
  inlet
  {
    type zeroGradient;
  }

  outlet
  {
    type zeroGradient;
  }

  wall
  {
    type noSlip;
  }
}

// vi: set ft=foam et sw=2 ts=2 sts=2:
