permeability/square-tube-flow-rate/0/p
FoamFile
{
  version 2.0;
  format ascii;
  class volScalarField;
  object p;
}

dimensions [0 2 -2 0 0 0 0];
internalField uniform 0;

boundaryField
{
  inlet
  {
    type fixedValue;
    value uniform 1e-2;
  }

  outlet
  {
    type fixedValue;
    value uniform 0;
  }

  wall
  {
    type zeroGradient;
  }
}

// vi: set ft=foam et sw=2 ts=2 sts=2:
