permeability/square-tube-flow-rate/system/fvSchemes
FoamFile
{
  version 2.0;
  format ascii;
  class dictionary;
  object fvSchemes;
}

ddtSchemes
{
  default Euler;
}

gradSchemes
{
  default Gauss linear;
}

divSchemes
{
  default none;

  div(phi,U) Gauss vanLeerV;
  div((nuEff*dev2(T(grad(U)))))  Gauss linear;
}

laplacianSchemes
{
  default Gauss linear corrected;
}

interpolationSchemes
{
  default linear;
}

snGradSchemes
{
  default corrected;
}

// vi: set ft=foam et sw=2 ts=2 sts=2:
